bouffalolab/bouffalo_sdk/drivers/soc/bl702/std/src/bl702_pm.c
ATTR_TCM_SECTION void pm_pds_enter_done(void)
{
    __asm__ __volatile__(
        "la     a2,     __ld_pds_bak_addr\n\t"
        "sw     ra,     0(a2)\n\t");

    __WFI(); /* if(.wfiMask==0){CPU won't power down until PDS module had seen __wfi} */
}
/**
 * @brief power management in pds(power down sleep) mode
 *
 * cpu's behavior after wakeup depend on psd level,see flow table if cpu off , cpu will reset after wakeup
 *
 *                      PD_CORE     PD_CORE_MISC_DIG    PD_CORE_MISC_ANA    PD_CORE_CPU     PD_BZ   PD_USB
 *          PDS0          ON               ON                  ON               ON            ON      ON
 *          PDS1          ON               ON                  ON               ON            ON      OFF
 *          PDS2          ON               ON                  ON               ON            OFF     ON
 *          PDS3          ON               ON                  ON               ON            OFF     OFF
 *          PDS4          ON               ON                  ON               OFF           ON      ON
 *          PDS5          ON               ON                  ON               OFF           ON      OFF
 *          PDS6          ON               ON                  ON               OFF           OFF     ON
 *          PDS7          ON               ON                  ON               OFF           OFF     OFF
 *          PDS31         ON               OFF                 OFF              OFF           OFF     OFF
 */
ATTR_TCM_SECTION void pm_pds_mode_enter(enum pm_pds_sleep_level pds_level, uint32_t sleep_time)
{
    PDS_DEFAULT_LV_CFG_Type *pPdsCfg = NULL;
    uint32_t tmpVal;
    uint32_t flash_cfg_len;

    /* To make it simple and safe*/
    __ASM volatile("csrc mstatus, 8");

    bflb_flash_get_cfg((uint8_t **)&flash_cfg, &flash_cfg_len);
    HBN_Set_Ldo11_All_Vout(PM_PDS_LDO_LEVEL_DEFAULT);

    BL_WR_REG(HBN_BASE, HBN_IRQ_CLR, 0xffffffff);
    BL_WR_REG(HBN_BASE, HBN_IRQ_CLR, 0);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
    tmpVal &= ~(1 << 8); //unmask pds wakeup

    if (!BL_GET_REG_BITS_VAL(BL_RD_REG(PDS_BASE, PDS_GPIO_INT), PDS_GPIO_INT_MASK)) {
        tmpVal |= (1 << 19); //enable gpio wakeup for pds
    }

    if (BL_GET_REG_BITS_VAL(BL_RD_REG(HBN_BASE, HBN_IRQ_MODE), HBN_REG_AON_PAD_IE_SMT)) {
        tmpVal |= (1 << 17); //enable hbn out0 wakeup for pds
    }

    if (sleep_time) {
        tmpVal |= (1 << 16); //unmask pds sleep time wakeup
    }
    BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

    PDS_Set_Vddcore_GPIO_IntClear();
    PDS_IntClear();

    /* enable PDS interrupt to wakeup CPU (PDS1:CPU not powerdown, CPU __WFI) */
    pm_pds_irq_register();

    switch (pds_level) {
        case PM_PDS_LEVEL_0:
            pPdsCfg = &pdsCfgLevel0;
            break;
        case PM_PDS_LEVEL_1:
            pPdsCfg = &pdsCfgLevel1;
            break;
        case PM_PDS_LEVEL_2:
            pPdsCfg = &pdsCfgLevel2;
            break;
        case PM_PDS_LEVEL_3:
            pPdsCfg = &pdsCfgLevel3;
            break;
        case PM_PDS_LEVEL_4:
            return;
        case PM_PDS_LEVEL_5:
            return;
        case PM_PDS_LEVEL_6:
            return;
        case PM_PDS_LEVEL_7:
            return;
        case PM_PDS_LEVEL_31:
            pPdsCfg = &pdsCfgLevel31;
            break;
        default:
            return;
    }

#if PM_PDS_FLASH_POWER_OFF
    HBN_Power_Down_Flash(flash_cfg);
    /* turn_off_ext_flash_pin, GPIO23 - GPIO28 */
    for (uint32_t pin = 23; pin <= 28; pin++) {
        GLB_GPIO_Set_HZ(pin);
    }
    /* borad flash_io with pull-down resistor, cannot pull-up flash_io */
    /* SF io select from efuse value */
    // uint32_t flash_select = BL_RD_WORD(0x40007074);
    // if (((flash_select >> 26) & 7) == 0) {
    //     HBN_Set_Pad_23_28_Pullup();
    // }
    pPdsCfg->pdsCtl.puFlash = 1;
#endif

#if PM_PDS_PLL_POWER_OFF
    PDS_Power_Off_PLL();
#endif
#if PM_PDS_DLL_POWER_OFF
    GLB_Set_System_CLK(GLB_DLL_XTAL_NONE, GLB_SYS_CLK_RC32M);
    AON_Power_Off_XTAL();
    GLB_Power_Off_DLL();
    PDS_Update_Flash_Ctrl_Setting(0);
#endif

    /* pds0-pds7 : ldo11rt_iload_sel=3 */
    /* pds31     : ldo11rt_iload_sel=1 */
    if (pds_level <= PM_PDS_LEVEL_7) {
        HBN_Set_Ldo11rt_Drive_Strength(HBN_LDO11RT_DRIVE_STRENGTH_25_250UA);
    } else if (pds_level == PM_PDS_LEVEL_31) {
        HBN_Set_Ldo11rt_Drive_Strength(HBN_LDO11RT_DRIVE_STRENGTH_10_100UA);
    } else {
        /* pdsLevel error */
    }

    pPdsCfg->pdsCtl.pdsLdoVol = PM_PDS_LDO_LEVEL_DEFAULT;
    pPdsCfg->pdsCtl.pdsLdoVselEn = 1;

#if PM_PDS_RF_POWER_OFF == 0
    pPdsCfg->pdsCtl.pdsCtlRfSel = 0;
#endif
    /* config  ldo11soc_sstart_delay_aon =2 , cr_pds_pd_ldo11=0 to speedup ldo11soc_rdy_aon */
    AON_Set_LDO11_SOC_Sstart_Delay(0x2);

    PDS_Default_Level_Config(pPdsCfg, sleep_time);

    __WFI(); /* if(.wfiMask==0){CPU won't power down until PDS module had seen __wfi} */

#if PM_PDS_PLL_POWER_OFF
    GLB_Set_System_CLK(GLB_DLL_XTAL_32M, GLB_SYS_CLK_DLL144M);
    PDS_Update_Flash_Ctrl_Setting(1);
#endif

#if PM_PDS_FLASH_POWER_OFF
    HBN_Set_Pad_23_28_Pullnone();
    /* Init flash gpio */
    bflb_sf_cfg_init_flash_gpio(0, 1);

    bflb_sf_ctrl_set_owner(SF_CTRL_OWNER_SAHB);
    bflb_sflash_restore_from_powerdown(flash_cfg, 0, 0);
#endif

    __ASM volatile("csrs mstatus, 8");
}

ATTR_TCM_SECTION void pm_pds31_fast_mode_enter(enum pm_pds_sleep_level pds_level, uint32_t sleep_time)
{
    PDS_DEFAULT_LV_CFG_Type *pPdsCfg = &pdsCfgLevel31;
    uint32_t tmpVal;
    uint32_t flash_cfg_len;

    // Get cache way disable setting
    cacheWayDisable = (*(volatile uint32_t *)(L1C_BASE + 0x00) >> 8) & 0x0F;

    // Get psram io configuration
    psramIoCfg = *(volatile uint32_t *)(GLB_BASE + 0x88);

    // Get flash offset
    flash_offset = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_ID0_OFFSET);

    /* To make it simple and safe*/
    __ASM volatile("csrc mstatus, 8");

    bflb_flash_get_cfg((uint8_t **)&flash_cfg, &flash_cfg_len);
    HBN_Set_Ldo11_All_Vout(PM_PDS_LDO_LEVEL_DEFAULT);

    BL_WR_REG(HBN_BASE, HBN_IRQ_CLR, 0xffffffff);
    BL_WR_REG(HBN_BASE, HBN_IRQ_CLR, 0);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
    tmpVal &= ~(1 << 8); //unmask pds wakeup

    if (!BL_GET_REG_BITS_VAL(BL_RD_REG(PDS_BASE, PDS_GPIO_INT), PDS_GPIO_INT_MASK)) {
        tmpVal |= (1 << 19); //enable gpio wakeup for pds
    }

    if (BL_GET_REG_BITS_VAL(BL_RD_REG(HBN_BASE, HBN_IRQ_MODE), HBN_REG_AON_PAD_IE_SMT)) {
        tmpVal |= (1 << 17); //enable hbn out0 wakeup for pds
    }

    if (sleep_time) {
        tmpVal |= (1 << 16); //unmask pds sleep time wakeup
    }
    BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

    PDS_Set_Vddcore_GPIO_IntClear();
    PDS_IntClear();

    /* enable PDS interrupt to wakeup CPU (PDS1:CPU not powerdown, CPU __WFI) */
    pm_pds_irq_register();

#if PM_PDS_FLASH_POWER_OFF
    HBN_Power_Down_Flash(flash_cfg);
    /* turn_off_ext_flash_pin, GPIO23 - GPIO28 */
    for (uint32_t pin = 23; pin <= 28; pin++) {
        GLB_GPIO_Set_HZ(pin);
    }
    /* SF io select from efuse value */
    uint32_t flash_select = BL_RD_WORD(0x40007074);
    if (((flash_select >> 26) & 7) == 0) {
        HBN_Set_Pad_23_28_Pullup();
    }
    pPdsCfg->pdsCtl.puFlash = 1;
#endif

