bouffalolab/bouffalo_sdk/drivers/soc/bl702/std/src/bl702_pm.c
void pm_hbn_mask_all_wakeup_src(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(HBN_BASE, HBN_IRQ_MODE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_PIN_WAKEUP_MASK, 0x1f);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_REG_AON_PAD_IE_SMT, 0x00);
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_REG_EN_HW_PU_PD);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_PIN_WAKEUP_MODE, HBN_GPIO_INT_TRIGGER_SYNC_FALLING_EDGE);
    BL_WR_REG(HBN_BASE, HBN_IRQ_MODE, tmpVal);
}

void pm_set_pds_wakeup_io(uint8_t pin, uint8_t trig_mode, uint8_t pupd)
{
    uint32_t tmpVal;
    GLB_GPIO_Cfg_Type gpio_cfg;

    if (pin > 7) {
        return;
    }

    gpio_cfg.drive = 0;
    gpio_cfg.smtCtrl = 1;
    gpio_cfg.gpioMode = GPIO_MODE_INPUT;
    gpio_cfg.pullType = GPIO_PULL_NONE;
    gpio_cfg.gpioPin = pin;
    gpio_cfg.gpioFun = GPIO_FUN_GPIO;

    GLB_GPIO_Init(&gpio_cfg);

    /*enable pds gpio wakeup and irq unmask*/
    tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_INT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_GPIO_INT_SELECT, pin);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_GPIO_INT_MODE, trig_mode);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_GPIO_INT_MASK);
    BL_WR_REG(PDS_BASE, PDS_GPIO_INT, tmpVal);
}

void pm_set_hbn_wakeup_io(uint8_t pin, uint8_t trig_mode, uint8_t pupd)
{
    uint32_t tmpVal;
    GLB_GPIO_Cfg_Type gpio_cfg;

    if ((pin < 9) || (pin > 13)) {
        return;
    }

    gpio_cfg.drive = 0;
    gpio_cfg.smtCtrl = 1;
    gpio_cfg.gpioMode = GPIO_MODE_INPUT;
    gpio_cfg.pullType = GPIO_PULL_NONE;
    gpio_cfg.gpioPin = pin;
    gpio_cfg.gpioFun = GPIO_FUN_GPIO;

    GLB_GPIO_Init(&gpio_cfg);

    tmpVal = BL_RD_REG(HBN_BASE, HBN_IRQ_MODE);
    tmpVal &= ~(1 << (pin - 9 + 3)); /* bit 3 ~ bit 7*/
    tmpVal |= (1 << (pin - 9 + 8));  /* bit 8 ~ bit 12*/
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_REG_EN_HW_PU_PD);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_PIN_WAKEUP_MODE, trig_mode);
    BL_WR_REG(HBN_BASE, HBN_IRQ_MODE, tmpVal);
}

void pm_pds_irq_register(void)
{
    bflb_irq_attach(PDS_WAKEUP_IRQn, (irq_callback)PDS_WAKEUP_IRQ, NULL);
    bflb_irq_enable(PDS_WAKEUP_IRQn);
}

void pm_hbn_out0_irq_register(void)
{
    bflb_irq_attach(HBN_OUT0_IRQn, (irq_callback)HBN_OUT0_IRQ, NULL);
    bflb_irq_enable(HBN_OUT0_IRQn);
}

void pm_hbn_out1_irq_register(void)
{
    bflb_irq_attach(HBN_OUT1_IRQn, (irq_callback)HBN_OUT1_IRQ, NULL);
    bflb_irq_enable(HBN_OUT1_IRQn);
}

void pm_set_wakeup_callback(void (*wakeup_callback)(void))
{
    BL_WR_REG(HBN_BASE, HBN_RSV1, (uint32_t)wakeup_callback);
    /* Set HBN flag */
    BL_WR_REG(HBN_BASE, HBN_RSV0, HBN_STATUS_ENTER_FLAG);
}

void pm_bor_init(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(HBN_BASE, HBN_IRQ_MODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_IRQ_BOR_EN);
    BL_WR_REG(HBN_BASE, HBN_IRQ_MODE, tmpVal);

    tmpVal = BL_RD_REG(HBN_BASE, HBN_MISC);
    tmpVal = BL_CLR_REG_BIT(tmpVal, HBN_PU_BOR);
    BL_WR_REG(HBN_BASE, HBN_MISC, tmpVal);

    tmpVal = BL_RD_REG(HBN_BASE, HBN_MISC);
    tmpVal = BL_SET_REG_BIT(tmpVal, HBN_PU_BOR);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_BOR_VTH, HBN_BOR_THRES_2P4V);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_BOR_SEL, HBN_BOR_MODE_POR_INDEPENDENT);
    BL_WR_REG(HBN_BASE, HBN_MISC, tmpVal);

    tmpVal = BL_RD_REG(HBN_BASE, HBN_IRQ_MODE);
    tmpVal = BL_SET_REG_BIT(tmpVal, HBN_IRQ_BOR_EN);
    BL_WR_REG(HBN_BASE, HBN_IRQ_MODE, tmpVal);
}

void HBN_OUT0_IRQ(void)
{
    if (SET == HBN_Get_INT_State(HBN_INT_GPIO9)) {
        HBN_Clear_IRQ(HBN_INT_GPIO9);
    }
    if (SET == HBN_Get_INT_State(HBN_INT_GPIO10)) {
        HBN_Clear_IRQ(HBN_INT_GPIO10);
    }
    if (SET == HBN_Get_INT_State(HBN_INT_GPIO11)) {
        HBN_Clear_IRQ(HBN_INT_GPIO11);
    }
    if (SET == HBN_Get_INT_State(HBN_INT_GPIO12)) {
        HBN_Clear_IRQ(HBN_INT_GPIO12);
    }
    HBN_Clear_IRQ(HBN_INT_RTC);
    HBN_Clear_RTC_INT();
}

void HBN_OUT1_IRQ(void)
{
    /* PIR */
    if (SET == HBN_Get_INT_State(HBN_INT_PIR)) {
        HBN_Clear_IRQ(HBN_INT_PIR);
    }
    /* BOR */
    if (SET == HBN_Get_INT_State(HBN_INT_BOR)) {
        HBN_Clear_IRQ(HBN_INT_BOR);
    }
    /* ACOMP0 */
    if (SET == HBN_Get_INT_State(HBN_INT_ACOMP0)) {
        HBN_Clear_IRQ(HBN_INT_ACOMP0);
    }
    /* ACOMP1 */
    if (SET == HBN_Get_INT_State(HBN_INT_ACOMP1)) {
        HBN_Clear_IRQ(HBN_INT_ACOMP1);
    }
}

void PDS_WAKEUP_IRQ(void)
{
    /* WAKE INT */
    if (SET == PDS_Get_IntStatus(PDS_INT_WAKEUP)) {
    }
    /* RF DONE */
    if (SET == PDS_Get_IntStatus(PDS_INT_RF_DONE)) {
    }
    /* PDS_INT_GPIO_IRQ */
    if (SET == PDS_Get_IntStatus(PDS_INT_GPIO_IRQ)) {
    }
    /* PDS_INT_PDS_SLEEP_CNT */
    if (SET == PDS_Get_IntStatus(PDS_INT_PDS_SLEEP_CNT)) {
    }

    PDS_Set_Vddcore_GPIO_IntClear();
    PDS_IntClear();
}